projectzonio/ESP32WebConfig/src/ESP32WebConfig.cpp
/*
 * ESP32WebConfig Library v1.0.0 - Implementation
 * Universal web configuration interface for ESP32/ESP8266
 * 
 * Author: ZONIO Project Team
 * License: MIT
 */

#include "ESP32WebConfig.h"
#include "WebPages.h"

// ===== CONSTRUCTOR AND DESTRUCTOR =====

ESP32WebConfig::ESP32WebConfig() {
    server = nullptr;
    dnsServer = nullptr;
    initialized = false;
    configChanged = false;
    lastSave = 0;
    saveDelay = 5000; // 5 seconds delay for auto-save
    eepromSize = WEBCONFIG_EEPROM_SIZE;
    eepromStartAddr = 0;
    autoSave = true;
    enableSTA = false;
    useDHCP = true;
    enableMDNS = true;
    
    // Default AP configuration
    apSSID = "ESP32-Config";
    apPassword = "12345678";
    apIP = IPAddress(192, 168, 4, 1);
    apGateway = IPAddress(192, 168, 4, 1);
    apSubnet = IPAddress(255, 255, 255, 0);
    
    // Default admin credentials
    adminUsername = "admin";
    adminPassword = "admin";
    
    // Default device name
    deviceName = "ESP32-Device";
    mdnsName = "esp32-config";
}

ESP32WebConfig::~ESP32WebConfig() {
    if (server) delete server;
    if (dnsServer) delete dnsServer;
}

// ===== BASIC CONFIGURATION =====

void ESP32WebConfig::setDeviceName(const String& name) {
    deviceName = name;
    if (mdnsName == "esp32-config") {  // If mDNS wasn't changed
        mdnsName = name;
        mdnsName.toLowerCase();
        mdnsName.replace(" ", "-");
    }
}

void ESP32WebConfig::setAPConfig(const String& ssid, const String& password, IPAddress ip) {
    apSSID = ssid;
    apPassword = password;
    apIP = ip;
    
    // Automatic gateway and subnet setup
    apGateway = ip;
    apSubnet = IPAddress(255, 255, 255, 0);
}

void ESP32WebConfig::setSTAConfig(const String& ssid, const String& password, IPAddress ip) {
    enableSTA = true;
    staSSID = ssid;
    staPassword = password;
    staIP = ip;
    useDHCP = (ip == IPAddress(0, 0, 0, 0));
}

void ESP32WebConfig::setCredentials(const String& username, const String& password) {
    adminUsername = username;
    adminPassword = password;
}

void ESP32WebConfig::setMDNS(const String& name) {
    mdnsName = name;
    mdnsName.toLowerCase();
    mdnsName.replace(" ", "-");
    enableMDNS = true;
}

void ESP32WebConfig::setEEPROM(int size, int startAddr) {
    eepromSize = size;
    eepromStartAddr = startAddr;
}

// ===== PARAMETERS - BASIC ADDITION =====

void ESP32WebConfig::addParameter(const String& key, const String& label, ParameterType type, const String& defaultValue) {
    ConfigParameter param;
    param.key = key;
    param.label = label;
    param.type = type;
    param.value = defaultValue;
    param.defaultValue = defaultValue;
    param.required = false;
    param.readOnly = false;
    param.order = parameters.size();
    param.group = "general";
    param.minValue = 0;
    param.maxValue = 100;
    param.step = 1;
    
    parameters.push_back(param);
}

void ESP32WebConfig::addParameter(const String& key, const String& label, ParameterType type,
                                 const String& defaultValue, const String& description,
                                 const String& validation, bool required) {
    addParameter(key, label, type, defaultValue);
    
    // Find just added parameter and modify it
    for (auto& param : parameters) {
        if (param.key == key) {
            param.description = description;
            param.validation = validation;
            param.required = required;
            break;
        }
    }
}

// ===== SPECIALIZED PARAMETERS =====

void ESP32WebConfig::addTextParameter(const String& key, const String& label, 
                                     const String& defaultValue, const String& placeholder) {
    addParameter(key, label, PARAM_TEXT, defaultValue);
    if (!placeholder.isEmpty()) {
        setParameterAttributes(key, "placeholder='" + placeholder + "'");
    }
}

void ESP32WebConfig::addPasswordParameter(const String& key, const String& label) {
    addParameter(key, label, PARAM_PASSWORD, "");
}

void ESP32WebConfig::addNumberParameter(const String& key, const String& label, 
                                       int defaultValue, int min, int max, int step) {
    addParameter(key, label, PARAM_NUMBER, String(defaultValue));
    for (auto& param : parameters) {
        if (param.key == key) {
            param.minValue = min;
            param.maxValue = max;
            param.step = step;
            break;
        }
    }
}

void ESP32WebConfig::addFloatParameter(const String& key, const String& label, 
                                      float defaultValue, float min, float max, float step) {
    addParameter(key, label, PARAM_FLOAT, String(defaultValue, 2));
    setParameterAttributes(key, "min='" + String(min, 2) + "' max='" + String(max, 2) + "' step='" + String(step, 2) + "'");
}

void ESP32WebConfig::addCheckboxParameter(const String& key, const String& label, bool defaultValue) {
    addParameter(key, label, PARAM_CHECKBOX, defaultValue ? "true" : "false");
}

void ESP32WebConfig::addSelectParameter(const String& key, const String& label, 
                                       const String& options, const String& defaultValue) {
    addParameter(key, label, PARAM_SELECT, defaultValue);
    setParameterAttributes(key, "data-options='" + options + "'");
}

void ESP32WebConfig::addRangeParameter(const String& key, const String& label, 
                                      int defaultValue, int min, int max, int step) {
    addParameter(key, label, PARAM_RANGE, String(defaultValue));
    for (auto& param : parameters) {
        if (param.key == key) {
            param.minValue = min;
            param.maxValue = max;
            param.step = step;
            break;
        }
    }
}

void ESP32WebConfig::addTextareaParameter(const String& key, const String& label, 
                                         const String& defaultValue, int rows) {
    addParameter(key, label, PARAM_TEXTAREA, defaultValue);
    setParameterAttributes(key, "rows='" + String(rows) + "'");
}

// ===== ADVANCED PARAMETERS =====

void ESP32WebConfig::addParameterToGroup(const String& group, const String& key, const String& label, 
                                        ParameterType type, const String& defaultValue) {
    addParameter(key, label, type, defaultValue);
    for (auto& param : parameters) {
        if (param.key == key) {
            param.group = group;
            break;
        }
    }
}

