projectzonio/ESP32WebConfig/src/ESP32WebConfig.cpp
void ESP32WebConfig::setParameterAttributes(const String& key, const String& attributes) {
    for (auto& param : parameters) {
        if (param.key == key) {
            param.attributes = attributes;
            break;
        }
    }
}

void ESP32WebConfig::setParameterOrder(const String& key, int order) {
    for (auto& param : parameters) {
        if (param.key == key) {
            param.order = order;
            break;
        }
    }
}

void ESP32WebConfig::setParameterReadOnly(const String& key, bool readOnly) {
    for (auto& param : parameters) {
        if (param.key == key) {
            param.readOnly = readOnly;
            break;
        }
    }
}

// ===== PARAMETER VALUES =====

String ESP32WebConfig::getValue(const String& key) {
    return getParameterValue(key);
}

int ESP32WebConfig::getInt(const String& key) {
    return getParameterValue(key).toInt();
}

float ESP32WebConfig::getFloat(const String& key) {
    return getParameterValue(key).toFloat();
}

bool ESP32WebConfig::getBool(const String& key) {
    String value = getParameterValue(key);
    return (value == "true" || value == "1" || value == "on");
}

bool ESP32WebConfig::setValue(const String& key, const String& value) {
    return setParameterValue(key, value);
}

bool ESP32WebConfig::setValue(const String& key, int value) {
    return setParameterValue(key, String(value));
}

bool ESP32WebConfig::setValue(const String& key, float value) {
    return setParameterValue(key, String(value, 2));
}

bool ESP32WebConfig::setValue(const String& key, bool value) {
    return setParameterValue(key, value ? "true" : "false");
}

// ===== CALLBACK SYSTEM =====

void ESP32WebConfig::onParameterChange(OnParameterChangeCallback callback) {
    onParameterChangeCallback = callback;
}

void ESP32WebConfig::onConfigSave(OnConfigSaveCallback callback) {
    onConfigSaveCallback = callback;
}

void ESP32WebConfig::onConfigLoad(OnConfigLoadCallback callback) {
    onConfigLoadCallback = callback;
}

void ESP32WebConfig::setCustomValidator(CustomValidatorCallback callback) {
    customValidator = callback;
}

// ===== CONTROL =====

void ESP32WebConfig::begin() {
    Serial.println("ESP32WebConfig: Initializing...");
    
    // Initialize EEPROM
    #ifdef ESP8266
    EEPROM.begin(eepromSize);
    #else
    EEPROM.begin(eepromSize);
    #endif
    
    // Load configuration
    load();
    
    // Initialize WiFi
    if (enableSTA) {
        initSTA();
    }
    initAP();
    
    // Initialize web server
    initWebServer();
    
    // Initialize mDNS
    if (enableMDNS) {
        initMDNS();
    }
    
    initialized = true;
    
    Serial.println("ESP32WebConfig: Initialization complete");
    Serial.printf("AP: %s (IP: %s)\n", apSSID.c_str(), apIP.toString().c_str());
    if (enableSTA) {
        Serial.printf("STA: %s\n", staSSID.c_str());
    }
    if (enableMDNS) {
        Serial.printf("mDNS: http://%s.local\n", mdnsName.c_str());
    }
}

void ESP32WebConfig::handle() {
    if (!initialized) return;
    
    if (server) server->handleClient();
    if (dnsServer) dnsServer->processNextRequest();
    
    // Auto-save if needed
    if (autoSave && configChanged && (millis() - lastSave > saveDelay)) {
        save();
    }
}

// ===== CONFIGURATION =====

bool ESP32WebConfig::save() {
    bool success = saveToEEPROM();
    if (success) {
        configChanged = false;
        lastSave = millis();
        Serial.println("ESP32WebConfig: Configuration saved");
        
        if (onConfigSaveCallback) {
            onConfigSaveCallback();
        }
    }
    return success;
}

bool ESP32WebConfig::load() {
    bool success = loadFromEEPROM();
    if (success) {
        Serial.println("ESP32WebConfig: Configuration loaded");
        
        if (onConfigLoadCallback) {
            onConfigLoadCallback();
        }
    } else {
        Serial.println("ESP32WebConfig: Using default configuration");
        setDefaults();
    }
    return success;
}

void ESP32WebConfig::reset() {
    Serial.println("ESP32WebConfig: Resetting configuration");
    clearEEPROM();
    setDefaults();
    save();
}

void ESP32WebConfig::setDefaults() {
    for (auto& param : parameters) {
        param.value = param.defaultValue;
    }
    configChanged = true;
}

// ===== EXPORT/IMPORT =====

String ESP32WebConfig::exportConfig() {
    JsonDocument doc;
    doc["device"] = deviceName;
    doc["version"] = ESP32WEBCONFIG_VERSION;
    doc["timestamp"] = millis();
    
    JsonObject config = doc["config"];
    for (const auto& param : parameters) {
        config[param.key] = param.value;
    }
    
    String output;
    serializeJson(doc, output);
    return output;
}

bool ESP32WebConfig::importConfig(const String& json) {
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, json);
    
    if (error) {
        Serial.printf("ESP32WebConfig: JSON parsing error: %s\n", error.c_str());
        return false;
    }
    
    JsonObject config = doc["config"];
    if (config.isNull()) {
        Serial.println("ESP32WebConfig: Invalid configuration format");
        return false;
    }
    
    // Import values
    for (JsonPair kv : config) {
        setParameterValue(kv.key().c_str(), kv.value().as<String>());
    }
    
    configChanged = true;
    Serial.println("ESP32WebConfig: Configuration imported");
    return true;
}

// ===== INFORMATION =====

bool ESP32WebConfig::isConfigChanged() {
    return configChanged;
}

String ESP32WebConfig::getVersion() {
    return ESP32WEBCONFIG_VERSION;
}

String ESP32WebConfig::getDeviceName() {
    return deviceName;
}

bool ESP32WebConfig::isConnected() {
    return WiFi.status() == WL_CONNECTED;
}

String ESP32WebConfig::getLocalIP() {
    if (isConnected()) {
        return WiFi.localIP().toString();
    }
    return "0.0.0.0";
}

String ESP32WebConfig::getAPIP() {
    return WiFi.softAPIP().toString();
}

