projectzonio/ESP32WebConfig/src/ESP32WebConfig.cpp
int ESP32WebConfig::getParameterCount() {
    return parameters.size();
}

std::vector<String> ESP32WebConfig::getParameterKeys() {
    std::vector<String> keys;
    for (const auto& param : parameters) {
        keys.push_back(param.key);
    }
    return keys;
}

void ESP32WebConfig::printConfig() {
    Serial.println("=== ESP32WebConfig - Current Configuration ===");
    for (const auto& param : parameters) {
        Serial.printf("%s = %s\n", param.key.c_str(), param.value.c_str());
    }
    Serial.println("============================================");
}

// ===== UTILITY FUNCTIONS =====

String ESP32WebConfig::getParameterValue(const String& key) {
    for (const auto& param : parameters) {
        if (param.key == key) {
            return param.value;
        }
    }
    return "";
}

bool ESP32WebConfig::setParameterValue(const String& key, const String& value) {
    for (auto& param : parameters) {
        if (param.key == key) {
            String oldValue = param.value;
            
            // Validation
            if (!validateParameter(param, value)) {
                return false;
            }
            
            param.value = value;
            configChanged = true;
            lastSave = millis();
            
            // Callback
            if (onParameterChangeCallback) {
                onParameterChangeCallback(key, oldValue, value);
            }
            
            return true;
        }
    }
    return false;
}

bool ESP32WebConfig::validateParameter(const ConfigParameter& param, const String& value) {
    // Basic validation by type
    switch (param.type) {
        case PARAM_NUMBER:
        case PARAM_RANGE: {
            int val = value.toInt();
            if (val < param.minValue || val > param.maxValue) {
                return false;
            }
            break;
        }
        case PARAM_FLOAT: {
            float val = value.toFloat();
            // For float we use attributes for min/max
            break;
        }
        case PARAM_EMAIL: {
            if (value.indexOf('@') == -1 || value.indexOf('.') == -1) {
                return false;
            }
            break;
        }
    }
    
    // Required field
    if (param.required && value.isEmpty()) {
        return false;
    }
    
    // Custom validator
    if (customValidator) {
        String error = customValidator(param.key, value);
        if (!error.isEmpty()) {
            Serial.printf("Validation error for %s: %s\n", param.key.c_str(), error.c_str());
            return false;
        }
    }
    
    return true;
}

// ===== NETWORK FUNCTIONS =====

void ESP32WebConfig::initAP() {
    #ifdef ESP8266
    WiFi.mode(enableSTA ? WIFI_AP_STA : WIFI_AP);
    #else
    WiFi.mode(enableSTA ? WIFI_AP_STA : WIFI_AP);
    #endif
    WiFi.softAPConfig(apIP, apGateway, apSubnet);
    WiFi.softAP(apSSID.c_str(), apPassword.c_str());
    
    Serial.printf("AP started: %s (IP: %s)\n", apSSID.c_str(), WiFi.softAPIP().toString().c_str());
}

void ESP32WebConfig::initSTA() {
    if (useDHCP) {
        WiFi.begin(staSSID.c_str(), staPassword.c_str());
    } else {
        WiFi.config(staIP, apGateway, apSubnet);
        WiFi.begin(staSSID.c_str(), staPassword.c_str());
    }
    
    Serial.printf("Connecting to WiFi: %s\n", staSSID.c_str());
}

void ESP32WebConfig::initWebServer() {
    server = new WebServer(80);
    dnsServer = new DNSServer();
    
    // Setup handlers
    server->on("/", [this]() { handleRoot(); });
    server->on("/config", [this]() { handleConfig(); });
    server->on("/network", [this]() { handleNetwork(); });
    server->on("/advanced", [this]() { handleAdvanced(); });
    server->on("/backup", [this]() { handleBackup(); });
    server->on("/save", HTTP_POST, [this]() { handleSave(); });
    server->on("/get", [this]() { handleGet(); });
    server->on("/set", HTTP_POST, [this]() { handleSet(); });
    server->on("/reset", [this]() { handleReset(); });
    server->on("/reboot", [this]() { handleReboot(); });
    server->on("/export", [this]() { handleExport(); });
    server->on("/import", HTTP_POST, [this]() { handleImport(); });
    server->on("/api/status", [this]() { 
        server->send(200, "application/json", getStatusJSON()); 
    });
    server->onNotFound([this]() { handleNotFound(); });
    
    server->begin();
    
    // DNS server for captive portal
    dnsServer->start(53, "*", apIP);
    
    Serial.println("Web server started on port 80");
}

void ESP32WebConfig::initMDNS() {
    #ifdef ESP8266
    if (MDNS.begin(mdnsName.c_str())) {
        MDNS.addService("http", "tcp", 80);
        Serial.printf("mDNS started: http://%s.local\n", mdnsName.c_str());
    }
    #else
    if (MDNS.begin(mdnsName.c_str())) {
        MDNS.addService("http", "tcp", 80);
        Serial.printf("mDNS started: http://%s.local\n", mdnsName.c_str());
    }
    #endif
}

// ===== WEB HANDLERS =====

void ESP32WebConfig::handleRoot() {
    if (!authenticate()) return;
    
    String html = getMainPageHTML();
    html = replacePlaceholders(html);
    server->send(200, "text/html", html);
}

void ESP32WebConfig::handleConfig() {
    if (!authenticate()) return;
    
    String html = getConfigPageHTML();
    html = replacePlaceholders(html);
    server->send(200, "text/html", html);
}

void ESP32WebConfig::handleSave() {
    if (!authenticate()) return;
    
    if (server->method() == HTTP_POST) {
        // Save all parameters from form
        bool hasChanges = false;
        
        for (auto& param : parameters) {
            if (server->hasArg(param.key)) {
                String newValue = server->arg(param.key);
                if (param.type == PARAM_CHECKBOX) {
                    newValue = server->hasArg(param.key) ? "true" : "false";
                }
                
