projectzonio/ESP32WebConfig/src/ESP32WebConfig.cpp
                if (param.value != newValue) {
                    if (setParameterValue(param.key, newValue)) {
                        hasChanges = true;
                    }
                }
            }
        }
        
        if (hasChanges) {
            save();
        }
        
        server->send(200, "text/html", 
            "<!DOCTYPE html><html><head><meta charset='UTF-8'><title>Saved</title>"
            "<meta http-equiv='refresh' content='3;url=/'></head><body>"
            "<h1>✅ Configuration saved!</h1>"
            "<p>Redirecting in 3 seconds...</p>"
            "</body></html>");
    }
}

void ESP32WebConfig::handleExport() {
    if (!authenticate()) return;
    
    String config = exportConfig();
    server->sendHeader("Content-Disposition", "attachment; filename=\"" + deviceName + "_config.json\"");
    server->send(200, "application/json", config);
}

void ESP32WebConfig::handleNotFound() {
    // Captive portal redirect
    server->sendHeader("Location", "http://" + apIP.toString(), true);
    server->send(302, "text/plain", "");
}

bool ESP32WebConfig::authenticate() {
    if (!server->authenticate(adminUsername.c_str(), adminPassword.c_str())) {
        server->requestAuthentication();
        return false;
    }
    return true;
}

// ===== EEPROM FUNCTIONS =====

bool ESP32WebConfig::saveToEEPROM() {
    JsonDocument doc;
    doc["magic"] = WEBCONFIG_MAGIC_NUMBER;
    doc["version"] = ESP32WEBCONFIG_VERSION;
    
    JsonObject config = doc["config"];
    for (const auto& param : parameters) {
        config[param.key] = param.value;
    }
    
    String output;
    serializeJson(doc, output);
    
    // Check size
    if (output.length() > eepromSize - 4) {
        Serial.println("ESP32WebConfig: Configuration too large for EEPROM");
        return false;
    }
    
    // Save size
    EEPROM.put(eepromStartAddr, (uint16_t)output.length());
    
    // Save data
    for (size_t i = 0; i < output.length(); i++) {
        EEPROM.write(eepromStartAddr + 2 + i, output[i]);
    }
    
    return EEPROM.commit();
}

bool ESP32WebConfig::loadFromEEPROM() {
    // Load size
    uint16_t size;
    EEPROM.get(eepromStartAddr, size);
    
    if (size == 0 || size > eepromSize - 4) {
        return false;
    }
    
    // Load data
    String input;
    input.reserve(size);
    for (uint16_t i = 0; i < size; i++) {
        input += (char)EEPROM.read(eepromStartAddr + 2 + i);
    }
    
    // Parse JSON
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, input);
    
    if (error) {
        Serial.printf("ESP32WebConfig: EEPROM data parsing error: %s\n", error.c_str());
        return false;
    }
    
    // Check magic number
    if (doc["magic"] != WEBCONFIG_MAGIC_NUMBER) {
        Serial.println("ESP32WebConfig: Invalid EEPROM data (magic number)");
        return false;
    }
    
    // Load values
    JsonObject config = doc["config"];
    for (JsonPair kv : config) {
        setParameterValue(kv.key().c_str(), kv.value().as<String>());
    }
    
    configChanged = false;
    return true;
}

void ESP32WebConfig::clearEEPROM() {
    for (int i = eepromStartAddr; i < eepromStartAddr + eepromSize; i++) {
        EEPROM.write(i, 0);
    }
    EEPROM.commit();
}

// ===== STATUS AND CONFIG JSON =====

String ESP32WebConfig::getStatusJSON() {
    JsonDocument doc;
    doc["device"] = deviceName;
    doc["version"] = ESP32WEBCONFIG_VERSION;
    doc["uptime"] = millis();
    doc["wifi_connected"] = isConnected();
    doc["wifi_ssid"] = WiFi.SSID();
    doc["local_ip"] = getLocalIP();
    doc["ap_ip"] = getAPIP();
    doc["free_heap"] = ESP.getFreeHeap();
    doc["config_changed"] = configChanged;
    
    String output;
    serializeJson(doc, output);
    return output;
}

String ESP32WebConfig::getConfigJSON() {
    JsonDocument doc;
    for (const auto& param : parameters) {
        doc[param.key] = param.value;
    }
    
    String output;
    serializeJson(doc, output);
    return output;
}

// ===== PLACEHOLDER REPLACEMENT =====

String ESP32WebConfig::replacePlaceholders(String html) {
    html.replace("%DEVICE_NAME%", deviceName);
    html.replace("%VERSION%", ESP32WEBCONFIG_VERSION);
    html.replace("%WIFI_SSID%", WiFi.SSID());
    html.replace("%WIFI_IP%", getLocalIP());
    html.replace("%AP_IP%", getAPIP());
    html.replace("%FREE_HEAP%", String(ESP.getFreeHeap()));
    html.replace("%UPTIME%", String(millis() / 1000));
    
    return html;
}

// Placeholder implementations for missing handlers
void ESP32WebConfig::handleNetwork() { handleRoot(); }
void ESP32WebConfig::handleAdvanced() { handleRoot(); }
void ESP32WebConfig::handleBackup() { handleRoot(); }
void ESP32WebConfig::handleGet() { server->send(200, "application/json", getConfigJSON()); }
void ESP32WebConfig::handleSet() { server->send(200, "text/plain", "OK"); }
void ESP32WebConfig::handleReset() { reset(); handleRoot(); }
void ESP32WebConfig::handleReboot() { ESP.restart(); }
void ESP32WebConfig::handleImport() { server->send(200, "text/plain", "OK"); }

// Placeholder implementations for missing template functions
String ESP32WebConfig::getMainPageHTML() { return WebPages::getMainPage(); }
String ESP32WebConfig::getConfigPageHTML() { return WebPages::getConfigPage(); }
String ESP32WebConfig::getNetworkPageHTML() { return WebPages::getNetworkPage(); }
String ESP32WebConfig::getAdvancedPageHTML() { return WebPages::getAdvancedPage(); }
String ESP32WebConfig::getBackupPageHTML() { return WebPages::getBackupPage(); }
String ESP32WebConfig::generateParameterGroupsHTML() { return ""; }
String ESP32WebConfig::getGroupTitle(const String& groupName) { return groupName; }
String ESP32WebConfig::generateParameterHTML(const ConfigParameter& param) { return ""; }
String ESP32WebConfig::generateSelectOptions(const ConfigParameter& param) { return ""; }
String ESP32WebConfig::getInputType(ParameterType type) { return "text"; }
void ESP32WebConfig::enableDebug(bool enable) { /* TODO */ }